<template>
  <br />
  <MDC :value="value" />
</template>
<script setup>
const value = `
# Механіка класів
В нас є механіка класів і на цій сторінці ми навчимо користуватися ними та прокачувати

## Як відкрити меню класу?
Щоб вибрати клас, який будете прокачувати пропишіть  \`/klas\`. Вам відкриється меню, де ви можете вибрати свій клас.
На даний момент ми маємо ось такі класи:
- Клас алхіміка
- Клас воїна

Клас асасіна на даний момент розробляється.

## Як прокачувати класи?
Щоб прокачати класи, введіть команду \`/gilka\`. Вам відкриється меню, де ви можете за якусь руду прокачувати його.


`
</script>
