<template>
  <br />
  <MDC :value="value" />
</template>
<script setup>
const value = `
# Як користуватися нашим плагіном на фракції?
Наші розробники доповнили плагін на фракції і ми на цій сторінці навчимо вас створювати, розширювати та прокачувати фракції. Ми тут лише згадаємо базові команди, а якщо ви хочете дізнатися більше команд, пропишіть \`/f help\`.

## Як приєднатися до існуючої фракції і вийти з неї?
Якщо вас запросили до якоїсь існуючої фракції, напишіть \`/f join (назва фракції)\`. Але якщо вам не сподобалась і ви хочете піти, то \`/f leave\`
## Як створити і прокачувати фракцію?
Якщо ви вирішили, що хочете стати лідером своєї фракції то ви маєте зробити то: Спершу, знайдіть місце де ви хочете створити фракцію та натисніть :kbd{value="F3"} :kbd{value="G"}. Далі ви повинні переконатися що у вас як мініум 1 сила щоб створити фракцію (щоб дізнатися скільки у вас є напишіть\`/f power\`). І після цього пропишіть \`/f create (назва фракції латиною чи кирилицею)\` щоб створити її.
::warning
Не забувайте прочитати механіку сили, для розуміння системи фракцій
::
::tip
Рекомендуємо вам створити Discord сервер своєї фракції!
::
## Як запросити гравців?
Після створення фракції ваші дурзі хочуть допомогти вам?. Щоб ваша фракція була потужнішою, правда? Тож щоб це зробити, ми повинні щоб лідер фракції прописав \`/f inv (нік майбутнього громадянина)\` ну і сам майбутній член фракції має прописати \`/f join (назва фракції)\`. Й щоб ваш громадянин міг допомагати то підвищте його роль. І для цього є комнада  \`/f promote (нік гравця)\` ,а також \`/f demote (нік гравця)\` обернена команда  до попередньой.
Загалом є 4 роли: рекрут, громодянин, модератор, коулідер(радник) й глава. Для кожного з них можна налаштувати свої права командой /f perms (відчиняти двері, ламати блоки і т. д.).
Тут ви можете замінити ще 4 роли не відношушеся до ваших громодян, ми повернемосе до них поже.

## Територія
Поки навіть якщо ви подивитися на мапу dynmap або напишите \`/f map\` то ви не побачите територій своїх, а діло в тому, що вам не даються вони при створені.
Ви повинні зачекати деякий час після створення, ібо у вас 0 сили після створення фракції, а фракція вимагає для розширення на 1 силу більше чим у вас є чанків \`/f who\` для першого привата вам треба або додати друга або пограти 5 хвилин й тоді у вас з'явиться можливість зайняти перший чанк.
Самі команди для цього: щоб розширитися напишіть \`/f claim\` і якщо хочете зробити чанк вільним, то \`/f unclaim\`
::note
Ви можете контролювати скільки чанків, скільки у вас сумарно сили у фракції. Зазвичай кожен має по 20 сили
::
## Прокачка
На цьому сервері ви можете ще й прокачувати фракцію командою \`/fskill\`. Вам відкриється меню де ви можете її прокачати за якись предмет.
Зазвичай вона для збільшення лімітної сили.

`
</script>
