<template>
  <br />
  <MDC :value="value" />
</template>
<script setup>
const value = `
# Як користуватися нашим плагіном на фракції?
Наші розробники доповнили плагін на фракції і ми на цій сторінці навчимо вас створювати, розширювати та прокачувати фракції. Ми тут лише згадаємо базові команди, а якщо ви хочете дізнатися більше команд, пропишіть \`/f help\`.

## Як приєднатися до існуючої фракції і вийти з неї?
Якщо вас запросили до якоїсь існуючої фракції, напишіть \`/f join (назва фракції)\`. Але якщо вам не сподобалась і ви хочете піти, то \`/f leave\`

## Як створити і прокачувати фракцію?
Якщо ви вирішили, що хочете стати лідером своєї фракції то ви маєте зробити то: Спершу, знайдіть місце де ви хочете створити фракцію та натисніть :kbd{value="F3"} :kbd{value="G"}. Далі ви повинні переконатися що у вас як мініум 1 сила щоб створити фракцію (щоб дізнатися скільки у вас є напишіть\`/f power\`). І після цього пропишіть \`/f create (назва фракції латиною)\` щоб створити її.
::warning
Кожну добу ваша сила буде зменшуватися на одну. Якщо буде мінімальна сила, то запуститься таймер, що триватиме добу. Якщо не зайти на сервер протягом таймеру, то фракція розформується! Тож будьте активними, якщо ви не хочете щоб ваша фракція зникла!
::
::tip
Рекомендуємо вам створити Discord сервер своєї фракції!
::
Якщо ви хочете заприватити чанк, щоб розширитися напишіть \`/f claim\` і якщо хочете зробити чанк вільним, то \`/f unclaim\`
::note
Ви можете контролювати скільки чанків, скільки у вас сумарно сили у фракції. Зазвичай кожен має по 20 сили
::
На цьому сервері ви можете ще й прокачувати фракцію командою \`/fskill\`. Вам відкриється меню де ви можете її прокачати за якись предмет.

## Як запросити гравців?
Ви хочете запросити гравців до своєї фракції, щоб вам було веселіше, правда? Тож це можна зробити. \`/f promote (нік гравця)\` щоб підвищити громадянина і \`/f demote (нік гравця)\`щоб понизити

## Стани фракцій
На даний момент фракцію можуть мати такі стани:
1. Союз
2. Нейтралітет
3. Війна
4. Перемир'я
`
</script>