<template>
  <br />
  <MDC :value="value" />
</template>
<script setup>
const value = `
#№ Механіка сили
У кожного гравця ліміт сили від -10 до 20. Вона може коливатися від смертей й вбивств.
Ситуація наступна: кожні 5 хвилин капає одна сила, кожен вбитий ворожий гравець дасть вам 2 сили, але люба смерть відніме у вас 2 сили.

Сила потрібна для утримання міста/держави, а точніше його чанки. Кожна одна сила на балансі вашої фракції (подивитися \`/f who\`) дорівнює одному чанку. 
::warning
Ви не зможете заприватити більше територій чим ваша сила
::
Але візьмемо наступну ситуацію, якщо на нас напав ворог й вбив нас, але наша фракція мала рівно 10 сили й 10 чанків й після вбивтсва у нас тепер 8 сили, то робиться з чанками які не вклалися?
Тепер ворог може заприватити 2 наших чанка. Все що їм потрібно це зайти в наш чанк й прописати \`/f claim\` й наш чанк перейде під їх контроль.

::tip
Рекомендуємо вам тримати силу з запасом, щоб не ставалося таких ситуацій
::

Що ж тепер поговоримо про офлайн фракції. Весь перший вайп в нас не було системи чистки неактивних фракцій. Але зараз діє по наступній системі:
Кожні 24 часа з кожного гравця знімається 1 сила. Якщо в фракції на рахунку сумарна сила -9, то через 24 часа фракція видаляється.


</script>
