<template>
  <br />
  <MDC :value="value" />
</template>
<script setup>
const value = `


№Чарування тотемів
чарувати тотеми на нашому сервері можливо через клас духовника й вкаченим скілом. Після виповнення цих умов ви можете в ковадлі об'єднати тотем з будь чим й це вам може дати, як унікальний тотем так й зіпсований тотем.
Якщо пояснювати поподробней, то ви кладете тотем в лівий слот й любий предмет в правий й після того клікаєте в слот де щось має вийти після чого ви прочитуєте молитву й вам в інвентар видається тотем.
::warning
Якщо ви помістите зіпсований тотем й спробуєте його знову зачарувати, то він у вас зникне
::

#Класифікація
Тотеми діляться на 6 типів
- Орден
- Клятва
- Печатка
- Паразит
- Амулет
- Артефакт

Що ж вони роблять? Це просто класифікація: орден додає урон к чому то, клятва додає бонус к чому то вашому/рідному, печатка тотем який має не пасивний бонус, паразит забирає, щось для бонуса, амулет дає постійний бонус, артефакт найсильніші тотеми
Звісно рецептів у вас нема вам треба це все відривати, але на майбутнє класифікація присутня к рецептам. Наприклад один клас тотемів не потребує руну другий клас потребує определьону руну

`
</script>
