<template>
  <UPageHero headline="Скоро другий вайп!" title="Collapset — сервер, що починає свій шлях 🌍"
    description="Це український, політичний Minecraft сервер. Створений Максимом або більш відомий як Robnays, та іншими ентузіастами які мені допомогали, наприклад від перекладу плагіна до самого створення. Зі мною можна зв'язатися через Discord або Telegram (там однакові нікнейми). Дякую всім хто відвідав цей сайт 😁"
    orientation="horizontal">
    <img src="/images/promo.svg" alt="Пам'ятник в альтадорі, що з першого вайпу" class="h-full mx-auto my-0" />
    <template #links>
      <JoinInst />
    </template>
  </UPageHero>

  <USeparator />

  <UPageSection title="Найкращі скріншоти та карикатури 🖼️">
    <UBlogPosts>
      <UBlogPost title="Потужний: Ахіреть я в ньому жити можу" image="/images/memes/image-2.png" />
      <UBlogPost title="Два різних світа" image="./images/memes/image12.png" />
      <UBlogPost title="Гора за 3 дня" image="./images/memes/pot.png" />
    </UBlogPosts>
  </UPageSection>

  <USeparator />

  <UPageSection title="Події">
    <UBlogPosts>
      <UBlogPost title="Облога замку" image="/images/events/1/thumbnail.webp" date="2025-10-20" to="/event/1"
        description="О 20:00 почалася облога замку де гравці які в більшості випадках були в залізні броні намагалися взірвати кристал і якщо хочете дізнатися як все відбувалося, то клікніть тут" />
    </UBlogPosts>
  </UPageSection>

  <!-- <USeparator />

  <UPageSection title="Q&A"
    description="Тут написані запитання, які часто задають гравці і на них ви можете подивитися відповідь">

  </UPageSection> -->
</template>
