<template>
   <UPageSection title="Правила нашого чудового серверу 📜">
      <MDC :value="value" />
   </UPageSection>
</template>
<script setup lang="ts">
import { useHead } from 'nuxt/app';

useHead({
   title: "Collapset | Правила",
   meta: [
      { name: "description", content: "Щоб грати на нашому українському,політичному Minecraft сервері, ознайомтеся, будь ласка, із правилами! Дізнайтеся, що в нас можна, а що ні." },
      { property: "og:title", content: "Collapset | Правила" },
      { property: "og:description", content: "Щоб грати на нашому українському,політичному Minecraft сервері, ознайомтеся, будь ласка, із правилами! Дізнайтеся, що в нас можна, а що ні." },
      { property: "og:url", content: "https://collapset.vercel.app/rules" },
      { property: "og:type", content: "website" },
   ],
})

const value = `
## 💬 1. Чат і спілкування
1. ❌ Заборонено спам та флуд.
2. ⚠️ Заборонене шахрайство.
3. 📢 Заборонена будь-яка реклама *(**Discord-серверів**, **YouTube-каналів**, **вебсайтів**, **Minecraft-серверів**)*, але дозволяється, якщо це пов'язано із нашим проєктом.
4. 🔞 Заборонений NSFW сонтент (порнографія)
5. 🆔 Заборонено надсилати персональну інформацію ( Прізвища, обличчя і т. д.) без згоди самої людини

---

## ⚒️ 2. Ігровий процес
1. ⛔ Заборонене використання моди та ресурспаки - ті що, дають велику перевагу в грі. Всі чити заборонені. За це *(бан назавжди)*! Наприклад:
   - Мінімапи:
      - Xaero's Minimap
      - WagYourMinimap
      - JourneyMap
   - Чити:
      - Freecam
      - X-Ray
      - CheatUtils
      - Auto-Totem
      - Auto Attack
      - Attack-Blocker
      - Attack Through Grass
      -  Bing's Auto
      - Attack ESP Texture Pack
      - Glowing ESP
      - ChestESP
      - Easyplace [Litematica]

2. ✅ Дозволені лише візуальні моди *(наприклад, **OptiFine**, **BetterF3**) та **Xaero's Minimap (Fair-play Edition)***.
   *(Попередження → потім **бан** до 2 місяців)*
3. 🔥 Дюпи заборонені, окрім TNT-механізмів.
4. ⚜️ Незером можна виключно добувати там ресурси, або скорочувати шлях! При порушені цього правила ви не зможете більше заходити в цей вимір!
5. 🕒 Заборонено навмисно чекати офлайн-стану суперника для нападу.
   *(Покарання визначається радою гравців)*

---

## 🏗️ 3. Будівлі
1. 🌋 Заборонено заливати спавн лавою.
2. 💣 Заборонено руйнування баз інших фракцій (підривання, лавокаст, підпал).
3. 🏠 Заборонено будувати базу на кордоні світу чи під водою, робити її такою, що динаміт її не зможе знищити і вона повинна бути лише в звичайному світі.
4. 🚜 Ферми ресурсів повинні бути такими, що їх неможливо буде перенести в звичайний світ і вони не можуть бути запривачені кимось.
2.5 🎭 Мульти акаунство заборонено на сервері

---

## 🔫 4. Війни
1. ⚔️ Заборонено нападати на фракції без причини. Причина може бути від домовленостей до ультиматума.
2. ❓ Якщо у вас є причина, але ви не знаєте чи підпадає вона під неї до спитайте в адміністрації
3. ✈️ Заборонені летючі механізми у війнах.

---

> # І пам'ятайте: Наша аднімістрація приймає ВСІ-ВСІ покарання.

`
</script>
