<template>
   <UPageSection title="Правила нашого чудового серверу 📜">
      <MDC :value="value" />
   </UPageSection>
</template>
<script setup lang="ts">
import { useHead } from 'nuxt/app';

useHead({
   title: "Collapset | Правила",
   meta: [
      { name: "description", content: "Щоб грати на нашому українському,політичному Minecraft сервері, ознайомтеся, будь ласка, із правилами! Дізнайтеся, що в нас можна, а що ні." },
      { property: "og:title", content: "Collapset | Правила" },
      { property: "og:description", content: "Щоб грати на нашому українському,політичному Minecraft сервері, ознайомтеся, будь ласка, із правилами! Дізнайтеся, що в нас можна, а що ні." },
      { property: "og:url", content: "https://collapset.vercel.app/rules" },
      { property: "og:type", content: "website" },
   ],
})

const value = `
# 💬 1. Чат і спілкування
1. ❌ Заборонено спам та флуд.
2. ⚠️ Заборонене шахрайство.
3. 📢 Заборонена будь-яка реклама *(**Discord-серверів**, **YouTube-каналів**, **вебсайтів**, **Minecraft-серверів**)*, але дозволяється, якщо це сервери, пов’язані з проєктом.

---

# ⚒️ 2. Ігровий процес
1. ⛔ Заборонене використання моди та ресурспаки - ті що, дають велику перевагу в грі. Всі чити заборонені. За це *(бан назавжди)*! Наприклад:
   - Мінімапи:
      - Xaero's Minimap
      - WagYourMinimap
      - JourneyMap
   - Чити:
      - Freecam
      - X-Ray
      - CheatUtils
      - Auto-Totem
      - Auto Attack
      - Attack-Blocker
      - Attack Through Grass
      -  Bing's Auto
      - Attack ESP Texture Pack
      - Glowing ESP
      - ChestESP
      - Easyplace [Litematica]

2. ✅ Дозволені лише візуальні моди *(наприклад, **OptiFine**, **BetterF3**) та **Xaero's Minimap (Fair-play Edition)***.
   *(Попередження → потім **бан** до 2 місяців)*
3. 🔥 Дюпи заборонені, окрім TNT-механізмів.

---

# 🏗️ 3. Будівлі
1. 🌋 Заборонено заливати спавн лавою.
2. 💣 Заборонено руйнування баз інших фракцій (підривання, лавокаст, підпал).

---

# 🕹️ 4. Спеціальні дії
1. 🕒 Заборонено навмисно чекати офлайн-стану суперника для нападу.  
   *(Покарання визначається радою гравців)*
`
</script>